// пример изменения частоты ШИМ на ШИМ пинах atmega328
// при изменении ШИМ у таймера 0 функции времени начинают работать некорректно
// в библиотеке есть fixed функции, смотри пример fixedTime
/*
Timer 0 (пины 5 и 6) (ВЛИЯЕТ НА РАБОТУ millis() и delay())
Timer 1 (пины 9 и 10) (ВЛИЯЕТ НА РАБОТУ servo)
Timer 2 (пины 3 и 11) (ВЛИЯЕТ НА РАБОТУ tone())
*/

/*
____________________________________________________________________________________________
	| Timer 0 (пины 5 и 6)		| Timer 1 (пины 9 и 10) 		| Timer 2 (пины 3 и 11)		| 
	| Timer 1 (пины 9 и 10)		| в режиме 10 bit				|							| 
____|___________________________|_______________________________|___________________________|
mode| Phase-correct	| Fast PWM	| Phase-correct		| Fast PWM	| Phase-correct	| Fast PWM	|
____|_______________|___________|___________________|___________|_______________|___________|
1	| 31.4 kHz		| 62.5 kHz	| 7.8 kHz			| 15.6 kHz	| 31.4 kHz		| 62.5 kHz	| 
2	| 4 kHz			| 7.8 kHz	| 977 Hz			| 2 kHz		| 4 kHz			| 8 kHz		| 
3	| 490 Hz		| 976 Hz	| 122 Hz			| 244 Hz	| 980 Hz		| 2 kHz		| 
4	| 122 Hz		| 244 Hz	| 30 Hz				| 61 Hz		| 490 Hz		| 980 Hz	| 
5	| 30 Hz			| 61 Hz		| 7.6 Hz			| 15 Hz		| 245 Hz		| 490 Hz	| 
6	| -				| -			| -					| -			| 122 Hz		| 244 Hz	| 
7	| -				| -			| -					| -			| 30 Hz			| 60 Hz		| 
____|_______________|___________|___________________|___________|_______________|___________|
*/


#include "GyverHacks.h"

void setup() {  
  setPWMprescaler(5, 2);	// установить режим (ШИМ пин, режим) в этом случае на пин 5 частота 7,8 кГц 
  pinMode(5, OUTPUT);
  setPWM(5, 125);			    // запустить ШИМ
}

void loop() {

}
